# NewSpaces2 Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Document..::..NewSpaces2 Method
Document Class See Also
---
Creates one or more spaces.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NewSpaces2(Phase, Int32) | Creates a set of new unplaced spaces on a given phase. |
| NewSpaces2(Level, Phase, View) | Creates new spaces on the available plan circuits of a the given level. |

# See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace